/*-----------------------------------------------------------------------------------------
**
** 版权(Copyright): Inory, 2022~
**
** 文件名(FileName): main.cpp
**
** 描述(Description): 本文件定义应用软件的程序入口函数(主函数)
**
** 包含的函数(Included Function):
**
** 设计注记(Design Annotation):
**
** 作者(Author):
**      Inory, 2022年5月22日开始编写本文件
**
** 更改历史(Modification History):
**      Inory, 2022年5月22日 创建本文件
**      $Revision$
**      $Date$
**      $Author$
**      $Log$
**
**-----------------------------------------------------------------------------------------
*/
/*-----------------------------------------------------------------------------------------
**                                         Include
**-----------------------------------------------------------------------------------------
*/
#include <stdio.h>

/*-----------------------------------------------------------------------------------------
**                                   Function Definition
**-----------------------------------------------------------------------------------------
*/
/*.BH--------------------------------------------------------------------------------------
**
** 函数名(Function Name): main
**
** 描述(Description): 本函数定义应用软件的入口函数(主函数)
**
** 输入参数(Input Parameter):
**      argc , int 程序启动参数个数
**      argv , char** 参数列表
**
** 输出参数(Output Parameter):
**
** 返回值(Return Value):
**      int
**
** 设计注记(Design Annotation):
**
** 更改历史(Modification History):
**      Inory, 2022年5月22日 创建本函数
**      $Log$
**
**.EH--------------------------------------------------------------------------------------
*/
int main(int argc, char* argv[])
{
    return 0;
}
/* END of main */
